#______________конфиги______________
#контрольное фото
source_control="Source/photo_2023-11-25_16-46-49.jpg"
#рабочее фото
source="Source/photo_2023-11-25_16-46-49 (2).jpg"
#степень смены градиента для точек
grad_changing=200
#слои градиента
gradient_layers=2
#шаг изменения градиента
grad_change_step=100
#различие между контрольной точкой и текущей
dif_сontrol_current_point=1
#разница по У между верхней и нижней точкой
delta_y_point=100
#степень совпадения по среднему цвету
coincidence_average_color=20
#попиксельная степень подтверждения совпадений
confirm_matches=25
#отфильтровка самых частых совпадений точек по оси У (0-1)
filter_sovpad_point=1
#фильтрование конечных точек по близости значений к контрольной точки (0-1)
filter_sovpad=1